Revit 2026 API

# NavisworksCoordinates Enumeration

---

An enumerated type listing possible Coordinates of Navisworks Exporter.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum NavisworksCoordinates
```
```vb
Public Enumeration NavisworksCoordinates
```
```cpp
public enum class NavisworksCoordinates
```
```fsharp
type NavisworksCoordinates
```

| Member name | Value | Description |
| --- | --- | --- |
| Internal | 0 | Use Revit internal coordinates. |
| Shared | 1 | Shared coordinates can be viewed and modified outside of Revit. |

#### Reference

Autodesk.Revit.DB Namespace